app/Helpers/CIFunctions_helper.php

if(!function_exists('get_user')){
    if (CIAuth::check()) {
        $user = new User();
        return $user->asObject()->where('id',CIAuth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1