app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
UPDATE `users` SET `picture` = 'UIMG11696439206_b31677296a184e5b4fa4.png'
WHERE `id` = '1'
---
    public function updateProfilePicture(){
        $request = \Config\Services::request();
        $user_id = CIAuth::id();
        $user = new User();
        $user_info = $user->asObject()->where('id',$user_id)->first();

        $path = 'images/users/';
        $file = $request->getFile('user_profile_file');
        $old_picture = $user_info->picture;
        $new_filename = 'UIMG'.$user_id.$file->getRandomName();

        /*if($file->move($path,$new_filename)){
            if($old_picture != null && file_exists($path.$old_picture)){
                unlink($path.$old_picture);
            }
            $user->where('id',$user_info->id)->set((['picture'=>$new_filename]))->update();