app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@email.com'
 LIMIT 1
SELECT *
FROM `password_reset_tokens`
WHERE `email` = 'admin@email.com'
 LIMIT 1
UPDATE `password_reset_tokens` SET `token` = '4d9b9538c8104b01a78b153201fe440cbd9b2f0e5e345b873f2830f629f36e8f03197afe604d98346a102dc405b299aaae9b1e93ff0368c00d8071fbc7dd947ae9', `created_at` = '2023-10-03 11:35:25'
WHERE `email` = 'admin@email.com'
---
    public function sendPasswordResetLink(){
        $isValid = $this->validate([
            'email'=>[
                'rules'=>'required|valid_email|is_not_unique[users.email]',
                'errors'=>[
                    'required'=>'Escribe tu correo',
                    'valid_email'=>'Por favor, escribe un correo válido',
                    'is_not_unique'=>'El correo no existe en el sistema'
                ],
            ]
        ]);

        if (!$isValid) {
            return view('backend/pages/auth/forgot',[
                'pageTitle'=>'Contraseña Olvidada',
                'validation'=>$this->validator
            ]);
        }else{
            //Obtener detalles del usuario admin
            $user = new User();
            $user_info = $user->asObject()->where('email',$this->request->getVar('email'))->first();

            //Generar token
            $token = bin2hex(openssl_random_pseudo_bytes(65));

            //Obtener token para resetear password
            $password_reset_token = new PasswordResetToken();
            $isOldTokenExists = $password_reset_token->asObject()->where('email',$user_info->email)->first();

            if ($isOldTokenExists) {
                //Actualizar token existente
                $password_reset_token->where('email', $user_info->email)->set(['token'=>$token,'created_at'=>Carbon::now()])->update();

SELECT *
FROM `password_reset_tokens`
WHERE `token` = 'd26ab29ecee4c5710ddbb5bff8e445fbabb1c37f8441d781f41ab1c35385a47f53ee7b1f250bcf81bcfcb7b86e2dc335407af0aaf49b2410ec49c8c348c43269d1'
 LIMIT 1
---
    public function resetPassword($token){
        $passwordResetPassword = new PasswordResetToken();
        $check_token = $passwordResetPassword->asObject()->where('token', $token)->first();